In [3]:
import pandas as pd
pd.DataFrame({"A":[1,2], "B":[3,4]},index=[1,2])

   A  B
1  1  3
2  2  4

In [4]:
pd.DataFrame({"A":[1,2], "B":[3,4]}, index=[1,2])

   A  B
1  1  3
2  2  4

In [5]:
pd.DataFrame({"A":[1,2], "B":[3,4]}, index=[1,2])

   A  B
1  1  3
2  2  4

In [6]:
pd.DataFrame({"A":[1,2,3], "b":[4,5,6]}, index=[1,2,3])

   A  b
1  1  4
2  2  5
3  3  6

In [7]:
pd.DataFrame({"A":[1,2], "B":[3,4], "C":[5,6]}, index=[1,2])

   A  B  C
1  1  3  5
2  2  4  6

In [8]:
pd.DataFrame([[1,3,5],[2,4,6]])

   0  1  2
0  1  3  5
1  2  4  6

In [10]:
pd.DataFrame([[1,4,7],[2,5,8],[3,6,9]])

   0  1  2
0  1  4  7
1  2  5  8
2  3  6  9

In [11]:
pd.DataFrame([[1,2,3],[4,5,6]], index=[1,2], columns=["A","B","C"])

   A  B  C
1  1  2  3
2  4  5  6

In [12]:
pd.DataFrame([[1,2,3,4],[5,6,7,8],[9,10,11,12],[13,14,15,16]], index=[1,2,3,4], columns=["A","B","C","D"])

    A   B   C   D
1   1   2   3   4
2   5   6   7   8
3   9  10  11  12
4  13  14  15  16

In [21]:
pd.DataFrame([[1,2,3],[4,5,6]], index=range(1,3), columns=["A","B","C"])

   A  B  C
1  1  2  3
2  4  5  6

In [23]:
pd.Series({"한국":"서울", "일본":"도쿄", "중국":"베이징"})

한국     서울
일본     도쿄
중국    베이징
dtype: object